# HANDLING DATA

In [1]:
import pandas as pd
import numpy as np

# importing data

In [2]:
dataset = pd.read_csv('Data.csv')

In [3]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0      NaN       Yes
2  Germany   NaN  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0      NaN       Yes
8  Germany   NaN  83000.0        No
9   France  37.0      NaN       Yes

In [4]:
x = dataset.iloc[:,:-1].values
y = dataset.iloc[:,-1].values

In [5]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, nan],
       ['Germany', nan, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, nan],
       ['Germany', nan, 83000.0],
       ['France', 37.0, nan]], dtype=object)

In [6]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

# Finding null elements

In [7]:
dataset.isnull().sum()

Country      0
Age          3
Salary       4
Purchased    0
dtype: int64

In [8]:
dataset.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False    True      False
2    False   True   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False    True      False
8    False   True   False      False
9    False  False    True      False

# importing imputer function

In [9]:
from sklearn.impute import SimpleImputer

# Apply Simple Imputer

In [10]:
imputer = SimpleImputer(missing_values=np.nan, strategy='mean')

# Fittting the values in imputer

In [11]:
imputer.fit(x[:,1:3])

SimpleImputer()

In [12]:
x[:,1:3] = imputer.transform(x[:,1:3])

# Printing filled values

In [13]:
print(x)

[['France' 44.0 72000.0]
 ['Spain' 27.0 63333.333333333336]
 ['Germany' 38.42857142857143 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 63333.333333333336]
 ['France' 35.0 58000.0]
 ['Spain' 38.42857142857143 52000.0]
 ['France' 48.0 63333.333333333336]
 ['Germany' 38.42857142857143 83000.0]
 ['France' 37.0 63333.333333333336]]

# Data Pre-Processing-LabelEncoder

# Importing libraries

In [14]:
import pandas as pd

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
salary_class = pd.DataFrame({'Salary':[5000,84000,22000,75000,50000],
                            'Class':['low','high','low','high','medium']})

In [17]:
salary_class

   Salary   Class
0    5000     low
1   84000    high
2   22000     low
3   75000    high
4   50000  medium

salary_class = pd.DataFrame ({'Class':['low','high','low','high','medium'],
                              'Salary':[5000,84000,22000,75000,50000]})

In [19]:
salary_class

    Class  Salary
0     low    5000
1    high   84000
2     low   22000
3    high   75000
4  medium   50000

# Apply label encoder

In [20]:
lab_encode = LabelEncoder()

# Fitting the values and transforming

In [21]:
salary_class['Class'] = lab_encode.fit_transform(salary_class['Class'])

# label encoded out put

In [22]:
salary_class

   Class  Salary
0      1    5000
1      0   84000
2      1   22000
3      0   75000
4      2   50000

# Creating data

In [23]:
import pandas as pd

In [24]:
import pandas as pd

In [25]:
salary_class = pd.DataFrame ({'Class':['low','high','low','high','medium'],
                              'Salary':[5000,84000,22000,75000,50000]})

In [26]:
salary_class

    Class  Salary
0     low    5000
1    high   84000
2     low   22000
3    high   75000
4  medium   50000

In [32]:
salary_class = pd.DataFrame ({'Class':['low','high','low','high','medium'],
                              'Salary':[5000,84000,22000,75000,50000]})

In [33]:
salary_class

    Class  Salary
0     low    5000
1    high   84000
2     low   22000
3    high   75000
4  medium   50000

# unique data

In [34]:
salary_class.Class.unique()

array(['low', 'high', 'medium'], dtype=object)

# Creating order as list

In [45]:
order = ['low','medium','high']

In [46]:
order

['low', 'medium', 'high']

# Order Encoding

In [47]:
from sklearn.preprocessing import OrdinalEncoder

# Appling ordinls encoding

In [48]:
ord_enc = OrdinalEncoder(categories=[order])

In [49]:
ord_enc.fit(salary_class[["Class"]])

OrdinalEncoder(categories=[['low', 'medium', 'high']])

# Transforming the encoder

In [52]:
salary_class["Class"] = ord_enc.transform(salary_class[["Class"]])

In [53]:
salary_class

   Class  Salary
0    0.0    5000
1    2.0   84000
2    0.0   22000
3    2.0   75000
4    1.0   50000